---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterIsPost
source: html/17ba2b47-d5de-75a6-f151-f6567a1f241a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingBalusterIsPost Property

"Post"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingBalusterIsPost { get; }
```